
const CoursesCategoryList = [
    {
      category: "programming",
      name: "برنامه نویسی",
      categoryImage: "images/8.png",
      categoryTitle:
        "هر ساله، بر تعداد موقعیت‌های شغلی که مرتبط با برنامه‌نویسی هستند و یا پیش‌نیاز اصلی آن‌ها برنامه‌نویسی است، افزوده می‌شود. از طرفی، بخشی جدا نشدنی از فرایند تحقیق و پژوهش در اکثر رشته‌های دانشگاهی امروزی، کار با کامپیوتر و توانایی پیاده‌سازی ایده‌ها و الگوریتم‌ها در قالب برنامه‌های کامپیوتری است. قطعا در این مسیر، دانشجویان نیازمند یادگیری و کسب مهارت‌های برنامه‌نویسی هستند.",
      categoryPn: "",
    },
    {
      category: "artificialIntelligence",
      name: "هوش مصنوعی",
      categoryImage: "images/8.png",
      categoryTitle:
        "هوش مصنوعی ، هوشی است که توسط ماشین‌ها ظهور پیدا می‌کند، در مقابل هوش طبیعی[الف] که توسط جانوران شامل انسان‌ها نمایش می‌یابد. کتاب‌های AI پیشرو، این شاخه را به عنوان شاخه مطالعه بر روی «عوامل هوشمند» تعریف می‌کنند: هر سامانه‌ای که محیط خود را درک کرده و کنش‌هایی را انجام می‌دهد که شانسش را در دستیابی به اهدافش بیشینه می‌سازد.[ب] برخی از منابع شناخته شده از اصطلاح «هوش مصنوعی» جهت توصیف ماشینی استفاده می‌کنند که عملکردهای «شناختی» را از روی ذهن انسان‌ها تقلید می‌کنند، همچون «یادگیری» و «حل مسئله»، با این حال این تعریف توسط محققان اصلی در زمینه AI رد شده‌است.",
      categoryPn: "",
    },
    {
      category: "graphic",
      name: "گرافیک",
      categoryImage: "images/8.png",
      categoryTitle:
        "هر ساله، بر تعداد موقعیت‌های شغلی که مرتبط با برنامه‌نویسی هستند و یا پیش‌نیاز اصلی آن‌ها برنامه‌نویسی است، افزوده می‌شود. از طرفی، بخشی جدا نشدنی از فرایند تحقیق و پژوهش در اکثر رشته‌های دانشگاهی امروزی، کار با کامپیوتر و توانایی پیاده‌سازی ایده‌ها و الگوریتم‌ها در قالب برنامه‌های کامپیوتری است. قطعا در این مسیر، دانشجویان نیازمند یادگیری و کسب مهارت‌های برنامه‌نویسی هستند.",
      categoryPn: "",
    },
    {
      category: "web",
      name: "طراحی وب",
      categoryImage: "images/8.png",
      categoryTitle:
        "در واقع باید بگوییم طراحی وب سایت یک فرآیند برنامه ریزی شده، مفهوم سازی و تنظیم محتوای مورد نظر برای فضای اینترنت و دنیای بهینه سازی وب سایت می باشد. امروزه طراحی سایت به صورت اختصاصی در انواع زمینه های طراحی سایت فروشگاهی، آژانس هواپیمایی، گردشگری، خدمات زیبایی و کلینیک و غیره انجام می شود که کسانیکه قصد انجام طراحی سایت دارند می توانند متناسب با حوزه کسب و کار خود، سایت مورد نظر خود را انتخاب کنند.",
      categoryPn: "",
    },
    {
        category: "Mobile",
        name: "طراحی موبایل",
        categoryImage: "images/8.png",
        categoryTitle:
          "در واقع باید بگوییم طراحی وب سایت یک فرآیند برنامه ریزی شده، مفهوم سازی و تنظیم محتوای مورد نظر برای فضای اینترنت و دنیای بهینه سازی وب سایت می باشد. امروزه طراحی سایت به صورت اختصاصی در انواع زمینه های طراحی سایت فروشگاهی، آژانس هواپیمایی، گردشگری، خدمات زیبایی و کلینیک و غیره انجام می شود که کسانیکه قصد انجام طراحی سایت دارند می توانند متناسب با حوزه کسب و کار خود، سایت مورد نظر خود را انتخاب کنند.",
        categoryPn: "",
      },
      {
        category: "Hack",
        name: "هک  و امنیت",
        categoryImage: "images/8.png",
        categoryTitle:
          "در واقع باید بگوییم طراحی وب سایت یک فرآیند برنامه ریزی شده، مفهوم سازی و تنظیم محتوای مورد نظر برای فضای اینترنت و دنیای بهینه سازی وب سایت می باشد. امروزه طراحی سایت به صورت اختصاصی در انواع زمینه های طراحی سایت فروشگاهی، آژانس هواپیمایی، گردشگری، خدمات زیبایی و کلینیک و غیره انجام می شود که کسانیکه قصد انجام طراحی سایت دارند می توانند متناسب با حوزه کسب و کار خود، سایت مورد نظر خود را انتخاب کنند.",
        categoryPn: "",
      },
  ];
  export default CoursesCategoryList;
  